app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "email", "name", "salary", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save

UPDATE "users" SET "salary" = $1, "updated_at" = $2 WHERE "users"."id" = 1  [["salary", #<BigDecimal:7fd540013430,'0.12E5',9(18)>], ["updated_at", Sat, 16 Nov 2013 02:28:25 UTC +00:00]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)